[
  {
    "id": "1",
    "title": "About Zara",
    "content": "Zara is a leading global fashion retailer offering a wide range of clothing, accessories, shoes, and more for men, women, and children. Zara is known for its fast fashion, bringing the latest trends to customers around the world."
  },
  {
    "id": "2",
    "title": "Return Policy",
    "content": "Zara allows returns within 30 days of the purchase date. Items must be in their original condition, unworn, and with all tags attached. Refunds will be issued to the original form of payment. Please note that some items, like swimwear and underwear, are not eligible for return."
  },
  {
    "id": "3",
    "title": "Shipping Information",
    "content": "Zara offers several shipping options, including standard shipping (5-7 business days), express shipping (2-3 business days), and next-day delivery. Shipping costs may vary depending on the delivery method and location. Free standard shipping is available for orders over $50."
  },
  {
    "id": "4",
    "title": "Store Locations",
    "content": "Zara has physical stores in major cities around the world. You can use our store locator on the Zara website to find the nearest store to your location. The store locator also provides store hours and contact information."
  },
  {
    "id": "5",
    "title": "Contact Customer Service",
    "content": "Zara's customer service can be reached through various channels. You can contact us via email at customer.service@zara.com, by phone at 1-800-ZARA-USA, or through live chat on our website. Our customer service hours are Monday to Friday from 9 AM to 8 PM, and Saturday from 10 AM to 6 PM."
  },
  {
    "id": "6",
    "title": "Product Categories",
    "content": "Zara offers a variety of product categories including Women's Clothing, Men's Clothing, Kids' Clothing, Shoes, Accessories, and Beauty products. Each category is updated regularly with new arrivals to ensure that customers have access to the latest fashion trends."
  },
  {
    "id": "7",
    "title": "Sustainability Initiatives",
    "content": "Zara is committed to sustainability and has launched several initiatives to reduce its environmental impact. These include using sustainable materials in our products, reducing waste in our supply chain, and promoting recycling and reuse of clothing. Learn more about our sustainability efforts on our website."
  },
  {
    "id": "8",
    "title": "Order Tracking",
    "content": "Once your order is shipped, you can track it using the tracking number provided in your shipping confirmation email. Simply enter the tracking number on the Zara website's order tracking page to see the current status and estimated delivery date."
  },
  {
    "id": "9",
    "title": "Size Guide",
    "content": "Zara provides a detailed size guide to help you find the perfect fit. The size guide includes measurements for clothing, shoes, and accessories for men, women, and children. You can find the size guide linked on each product page."
  },
  {
    "id": "10",
    "title": "Gift Cards",
    "content": "Zara offers physical and electronic gift cards that can be used both online and in-store. Gift cards can be purchased in various denominations and do not expire. You can check the balance of your gift card on the Zara website."
  }
]