[
  {
    "id": "1",
    "title": "CS 1110 - Introduction to Computing",
    "content": "CS 1110 introduces programming and problem solving using Python. It emphasizes software development principles, style, and testing. Topics include procedural statements, loops, functions, recursion, arrays, strings, algorithms, exceptions, and object-oriented programming. The course is designed for students with no prior programming experience."
  },
  {
    "id": "2",
    "title": "CS 2110 - Object-Oriented Programming and Data Structures",
    "content": "CS 2110 focuses on intermediate programming in Java and introduces software engineering concepts. Topics include object-oriented programming, program correctness, algorithm analysis, recursion, data structures (e.g., lists, trees, hash tables), and event-driven programming. Students are expected to implement nontrivial Java programs and analyze their complexity. the prerequisites for this course is CS 1110."
  },
  {
    "id": "3",
    "title": "CS 2800 - Mathematical Foundations of Computing",
    "content": "CS 2800 covers the mathematics that underpins computer science. Topics include mathematical induction, logical proof, set theory, graphs, combinatorics, discrete mathematics, and probability theory. These concepts are explored in the context of applications to various areas of computer science. the prerequisites for this course are CS 1110 and MATH 1910."
  },
  {
    "id": "4",
    "title": "CS 3110 - Data Structures and Functional Programming",
    "content": "CS 3110 is an advanced programming course that emphasizes functional programming techniques and data structures. It covers recursive and higher-order functions, type systems, graph algorithms, balanced trees, memory heaps, and garbage collection. The course also includes techniques for analyzing program performance and correctness. the prerequisites for this course are CS 2110 and CS 2800."
  },
  {
    "id": "5",
    "title": "CS 3410 - Computer System Organization and Programming",
    "content": "CS 3410 introduces computer organization, systems programming, and the hardware/software interface. Topics include instruction sets, computer arithmetic, memory hierarchies, I/O devices, and multicore architectures. Students will learn assembly language programming and design a pipelined RISC processor. the prerequisites for this course are CS 2110 and CS 2800."
  }
]